package exam;
//Q1. 클래스가 인터페이스를 구현하기 위해 사용하는 예약어는 ( implements )입니다.
//Q2. 클래스가 인터페이스를 구현할 때 인터페이스에 선언한 메서드를 모두 구현하지 않으면 그 클래스는 ( 추상 클래스 )가 됩니다.
//Q3. 인터페이스에 선언한 변수는 컴파일할 때 ( 상수 )로 변환됩니다.
//Q4. 한 인터페이스를 여러 클래스가 다양한 방식으로 구현한 경우에 프로그램에서 인터페이스에 선언된 메서드를 사용할 때 각 클래스의 구현 내용과 상관없이 동일한 방식으로 사용할 수 있습니다. 이렇게 같은 코드가 여러 구현 내용으로 실행되는 객체 지향 특성을 ( 다형성 )이라고 합니다.
//Q5. 인터페이스에서 구현 코드를 제공하는 메서드는 ( 디폴트 메소드 )와 ( 정적 메소드 )입니다.
//Q6. 한 클래스에서 여러 인터페이스를 구현할 수 있습니다.(예/아니오) => 예
public class Exam0106 {
	public static void main(String[] args) {
		// TODO Auto-generated method stub
	}
}
